In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
pd.set_option('display.max_columns', None)

In [2]:
df = pd.read_csv("7E6D_student_grades.csv")
df.head()

  Student  Math (%)  History (%)  French (%)  Science (%)  English (%)
0    Abby      94.4         87.4        87.5         65.7         76.5
1   Brett      87.5         76.9        76.6         67.7         77.7
2   Colin      77.9         92.3        67.4         87.4         86.3
3   David      89.9         64.9        65.2         87.3         98.2
4  Debbie      87.5         87.5        98.4         97.4         91.1

In [3]:
df.shape

(19, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Student      19 non-null     object
 1   Math (%)     19 non-null     float64
 2   History (%)  19 non-null     float64
 3   French (%)   19 non-null     float64
 4   Science (%)  19 non-null     float64
 5   English (%)  19 non-null     float64
dtypes: float64(5), object(1)
memory usage: 1.0+ KB

In [5]:
df.Student.nunique()

19

In [7]:
# Calculate the total marks for each student
df["Total Marks"] = df[["Math (%)", "History (%)", "French (%)", "Science (%)", "English (%)"]].sum(axis=1)

In [8]:
df.head()

,Student,Math (%),History (%),French (%),Science (%),English (%),Total Marks
0,Abby,94.4,87.4,87.5,65.7,76.5,411.5
1,Brett,87.5,76.9,76.6,67.7,77.7,386.4
2,Colin,77.9,92.3,67.4,87.4,86.3,411.3
3,David,89.9,64.9,65.2,87.3,98.2,405.5
4,Debbie,87.5,87.5,98.4,97.4,91.1,461.9